#include "DEF_Type.h"
#include "lk_api.h"
#include "math.h"
#include "string.h"
#include "stdio.h"

u8 g_var1,g_var2;																													// 全局变量的定义
	  

extern void Communication_Test(u8 *in,u8 *out,u8 len);        // 通讯测试函数
extern void Write_Key(u8  *buf);                                     // 写入密钥函数

extern int Contrast_Authentication(u8 *pIn,u8 *pOut);  				//对比认证函数

extern void Write_Important_Data(u8 *pIn);                  				//发行阶段写入参数函数
extern int Read_Important_Data(u8 *pIn,u8 *pOut);    					// 使用阶段重要参数读取函数

extern int Algorithm_Transplantation(u8 *pIn,u8 *pOut); 			//算法移植函数
extern int My_Algorithm(u8 *pIn,u8 *pOut);
extern int Algorithm(u8 *pIn,u8 *pOut);


/*************************************** APP_INIT 全局变量初始化函数********************************************/
/****************************************************************************************************************
APP_INIT
初始化函数，如果有全局变量的话，请在此函数里做初始化
@@@@@@@@@@@@@@@@@@@@ 此函数名称 及 参数形式 不能修改 @@@@@@@@@@@@@@@@@@@@@@
*****************************************************************************************************************/
void APP_Init(void)
{

 g_var1 = 0x77;    																											//此处演示如何将全局变量初始化
 g_var1 = 0x88;
}



/*************************************** APP_Command 用户算法的入口函数 *****************************************/
/*****************************************************************************************************************
APP_Command 用户算法的入口函数

pInBuf -------------输入buf的长度 / 输入buf,LV格式
pOutBuf-------------算法输出buf的长度 / 输出buf, LV格式

 @@@@@@@@@@@@@@@@@@ 此函数名称 及 参数形式 不能修改 @@@@@@@@@@@@@@@@

指令传入示例说明： 8008 0000 09 01 1122334455667788  通讯测试指令
09 01 1122334455667788 数据会从 pInBuf 传入函数中，运行后的结果会从 pOutBuf传送出
*****************************************************************************************************************/


u32 APP_Command(u8 LenOfIn,u8 *pInBuf,u8 * LenOfOut,u8 *pOutBuf)
{
 u8  cmd;
 u32 res; 
 
 res = 0;
 cmd = pInBuf[0];//

	switch(cmd)
  {
		
		
			/*********************************************    通讯测试      ************************************************/
			/***************************************************************************************************************/		
			case 0x01:
				 Communication_Test( pInBuf + 1, pOutBuf , LenOfIn - 1 ); 
				 * LenOfOut = LenOfIn-1;
				 break;	
			
			
			
			/***************************  写入密钥  ---可供 对比认证、参数保护 、算法移植 密钥写入**************************/
			/***************************************************************************************************************/
			case 0x02:	
					Write_Key( pInBuf+1 ); 
					* LenOfOut = 0;
				 break;


			
			/*********************************************   对比认证   ****************************************************/
			/***************************************************************************************************************/
			case 0x03:	
				 res=Contrast_Authentication(pInBuf+1,pOutBuf); 
				 if( res == 0) return 0;
				 * LenOfOut = 0x10;	
				 break;
			 

			
			
			
			
			/********************************************   参数保护    ****************************************************/
			/***************************************************************************************************************/
			
			/*************************************** 发行阶段重要参数写入 **************************************************/
			case 0x04:
				Write_Important_Data(pInBuf+1);  
				* LenOfOut = 0;
				break;
			
			/*************************************** 使用阶段重要参数读取 **************************************************/
			case 0x05:
				res=Read_Important_Data(pInBuf+1,pOutBuf); 
				if(res == 0 ) return 0;
				* LenOfOut = 0x10;
				break;		
			

			
			
			
			/*******************************************    算法移植     ***************************************************/
			/***************************************************************************************************************/
			case 0x06:
			 res=Algorithm_Transplantation(pInBuf+1,pOutBuf); 
			 * LenOfOut = res;
			 break;

				
			/*******************************************         ***************************************************/
			/***************************************************************************************************************/
			case 0x07:
			 res=My_Algorithm(pInBuf+1,pOutBuf); 
			 * LenOfOut = res;
			 break;
			
			case 0x08:
				res=Algorithm(pInBuf+1,pOutBuf); 
			 * LenOfOut = res;
			 break;
			
			
			default:
					* LenOfOut = 0;
				return 0;														 //返回错误		 
	
	}
	
	
	return 1 ; //命令处理成功
	
	
}
